books.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-11-28 Tue 21:49 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>我的书单</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="yanyg" />
<link rel="stylesheet" type="text/css" href="css/pre1.css" />
<link rel="stylesheet" type="text/css" href="css/htmlize.css" />
<link rel="stylesheet" type="text/css" href="css/readtheorg.css" />
<link rel="stylesheet" type="text/css" href="css/readtheorg.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://ycode.org"> HOME </a>
</div><div id="content">
<h1 class="title">我的书单</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc97bb68">算法</a>
<ul>
<li><a href="#org36409e6">算法导论/Introduction to Algorithms</a></li>
<li><a href="#orgeaa909e">算法基础:打开算法之门/Algorithms Unlocked</a></li>
<li><a href="#orga84537e">计算机程序设计艺术/The Art of Computer Programming</a></li>
<li><a href="#orgcb30c0f">算法分析导论/An Introduction to the Analysis of Algorithms</a></li>
<li><a href="#orgfff2cd4">算法设计与分析基础/Introduction to The Design and Analysis of Algorithms</a></li>
<li><a href="#org7a27137">算法(第四版)/Algorithms(4th edition)</a></li>
</ul>
</li>
<li><a href="#org727649e">Linux内核</a>
<ul>
<li><a href="#org60c7c2f">深入理解LINUX内核/Understanding the Linux Kernel</a></li>
<li><a href="#orge8add16">LINUX设备驱动程序/Linux Device Drivers</a></li>
<li><a href="#orga8c6775">深入LINUX内核架构/Professional Linux Kernel Architecture</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgc97bb68" class="outline-2">
<h2 id="orgc97bb68">算法</h2>
<div class="outline-text-2" id="text-orgc97bb68">
</div>
<div id="outline-container-org36409e6" class="outline-3">
<h3 id="org36409e6">算法导论/Introduction to Algorithms</h3>
<div class="outline-text-3" id="text-org36409e6">
<p>
算法导论/Introduction to Algoriothms是知名的计算机算法教材, 通常被简称为CLRS,
这是四位作者的首字母. 这四位作者分别是<a href="http://www.cs.dartmouth.edu/~thc/">Thomas H. Cormen</a>, <a href="https://people.csail.mit.edu/cel/">Charles E. Leiserson</a>,
<a href="http://www.columbia.edu/~cs2035/">Clifford Stein</a>, <a href="http://people.csail.mit.edu/rivest/">Ronald Rivest</a>. Cormen就职于<a href="university.html#dartmouth">达特茅斯学院</a>(<a href="http://home.dartmouth.edu/">学校主页</a>), Stein是哥伦比亚大学<a href="http://ieor.columbia.edu/">IEOR</a>和<a href="http://www.cs.columbia.edu/">计算机科学</a>的教授. Leiserson与Rivest是<a href="http://web.mit.edu/">麻省理工</a>的教授.
</p>

<p>
本书是基础算法领域最权威、最详细的著作之一. 很多国际知名大学用本书作为计算机算法课的教材. 很多论文将其列入参考文献中.
</p>

<p>
算法导论是一本接近1300页的大部头(英文版, 中文版800多页), 读起来比较艰辛.
<a href="https://www.zhihu.com/search?type=content&amp;q=%E7%AE%97%E6%B3%95%E5%AF%BC%E8%AE%BA">知乎搜索</a>有大量本书内容和学习方法的研讨. 可以在<a href="http://open.163.com/special/opencourse/algorithms.html">新浪公开课</a>或<a href="https://www.youtube.com/watch?v=HtSuA80QTyo&amp;list=PLUl4u3cNGP61Oq3tWYp6V_F-5jb5L2iHb">youtube</a>上查看MIT
算法导论公开课. 我从2011年开始, 投入了大量业余时间在本书研读上. 我在
<a href="https://github.com/yygcode/ycc">Github Repo ycc</a>上有本书诸多算法的实现. 我的<a href="notes-books.html#introduction-to-algorithms">读书笔记</a>有部分习题的解答.
</p>
</div>
</div>

<div id="outline-container-orgeaa909e" class="outline-3">
<h3 id="orgeaa909e">算法基础:打开算法之门/Algorithms Unlocked</h3>
<div class="outline-text-3" id="text-orgeaa909e">
<p>
算法基础作者<a href="http://www.cs.dartmouth.edu/~thc/">Thomas H. Cormen</a>, 是算法导论作者之一. 本书只有220页. 包含算法分析,
排序与搜索, 图与最短路径, 字符串操作, 加密, 数据压缩内容.
</p>
</div>
</div>

<div id="outline-container-orga84537e" class="outline-3">
<h3 id="orga84537e">计算机程序设计艺术/The Art of Computer Programming</h3>
<div class="outline-text-3" id="text-orga84537e">
<p>
业界称为<a href="http://www-cs-faculty.stanford.edu/~knuth/taocp.html">TAOCP</a>, 作者<a href="http://www-cs-faculty.stanford.edu/~uno/">Donald E.Knuth(高德纳)</a>, <a href="https://www.stanford.edu/">斯坦福</a>大学荣誉教授, 1974年图灵奖得主, 计算机科学先驱人物, 创造了算法分析领域, 在计算机科学及数学领域发表了多部具有广泛影响的论文和著作. 高德纳最为人知的事迹是撰写了《计算机程序设计艺术》系列图书, 以及发明的电子排版系统<a href="https://tug.org/">TeX</a>(后扩展有<a href="https://www.latex-project.org/">Latex</a>/<a href="https://tug.org/xetex/">XeTex</a>).
</p>

<p>
计算机程序设计艺术系列计划完成7卷:
</p>
<dl class="org-dl">
<dt>卷1:基本算法</dt><dd></dd>
</dl>
<p>
讲解基本概念和信息结构. 基本概念包括数学准备, MIX汇编和若干程序设计技术. 信息结构包括线性表(栈, 队列, 链表, 数组), 树(二叉树, 树的基本数学性质), 多链结构和动态存储分配. 动态存储分配中讲到最先匹配方法和伙伴系统,
在Linux的内存管理模块<a href="https://www.kernel.org/doc/gorman/html/understand/understand022.html">Boot Memory Allocator</a>和<a href="https://www.kernel.org/doc/gorman/html/understand/understand009.html">Buddy System</a>中用到.
</p>

<dl class="org-dl">
<dt>卷2:半数值算法</dt><dd></dd>
</dl>
<p>
讲解随机数与算术. 随机数包括生成均匀随机数的线性同余法,
统计检验, 随机量和随机序列. 算术部分包括浮点, 多精度, 进制转换, 有理数, 多项式,
幂级数等算术. 卷二充斥着复杂的数学运算与分析.
</p>

<dl class="org-dl">
<dt>卷3:排序与查找</dt><dd></dd>
</dl>
<p>
排序部分包含组合性质, 内部排序(插入/交换/选择/合并/分布),最优排序(比较次数最少的排序/合并/选择), 外部排序(多路合并, 多阶段合并, 级联合并, 反向读取磁带,
震荡排序, 外部基础排序, 双磁带排序, 磁盘与磁鼓). 查找部分包括顺序查找, 键值比较查找(有序表, 二叉树, 平衡树, 多路树), 数字查找, 散列,辅助键查找. 卷三中的大多算法在操作系统和应用程序中有着广泛应用, 例如进程VMA(虚拟内存区间段)使用<a href="https://lwn.net/Articles/184495/">RBTree</a>,
文件系统中用到的<a href="https://lwn.net/Articles/490501/">B+树(多路树)</a>.
</p>

<dl class="org-dl">
<dt>卷4:组合算法</dt><dd></dd>
</dl>
<p>
讲解组合查找与递归. 第4卷涉及范围很大, 分为4A, 4B, 4C三卷出版. 4A讲组合查找,
4B和4C还未发布.
</p>

<dl class="org-dl">
<dt>卷5:语法算法</dt><dd>讲解词法分析与语法分析. 未发布.</dd>
<dt>卷6:语言理论</dt><dd>未发布.</dd>
<dt>卷7:编译器</dt><dd>未发布.</dd>
</dl>

<p>
希望能有闲暇时间, 可细细把玩此套书籍.
</p>
</div>
</div>

<div id="outline-container-orgcb30c0f" class="outline-3">
<h3 id="orgcb30c0f">算法分析导论/An Introduction to the Analysis of Algorithms</h3>
<div class="outline-text-3" id="text-orgcb30c0f">
<p>
算法分析导论(第二版)作者<a href="https://www.cs.princeton.edu/~rs/">Robert Sedgewick</a>, <a href="http://algo.inria.fr/flajolet/">Philippe Flajoet</a>. Robert在<a href="https://www.princeton.edu/">普林斯顿大学</a>
计算机科学系就职, 他同时还是多本计算机算法书籍(Algorithms 4th, Algorithms in
Java, Algorithms in C++, Algorithms in C)作者. Philippe于2011年3月22日逝世.
</p>
</div>
</div>

<div id="outline-container-orgfff2cd4" class="outline-3">
<h3 id="orgfff2cd4">算法设计与分析基础/Introduction to The Design and Analysis of Algorithms</h3>
<div class="outline-text-3" id="text-orgfff2cd4">
<p>
算法设计与分析基础, 作者<a href="http://www.csc.villanova.edu/~levitin/">Anany Levitin</a>, Villanova大学教授. 包括算法基本概念描述,
效率分析基础, 蛮力法, 减治法, 分治法, 变治法, 时空权衡, 动态规划, 贪婪技术, 迭代改进, 算法能力极限与超越算法能力极限, 提供了问题求解的诸多一般性策略.
</p>
</div>
</div>

<div id="outline-container-org7a27137" class="outline-3">
<h3 id="org7a27137">算法(第四版)/Algorithms(4th edition)</h3>
<div class="outline-text-3" id="text-org7a27137">
<p>
Java算法的入门书籍. 虽购买诸多时日, 却没有仔细翻阅这本书.
</p>
</div>
</div>
</div>

<div id="outline-container-org727649e" class="outline-2">
<h2 id="org727649e">Linux内核</h2>
<div class="outline-text-2" id="text-org727649e">
</div>
<div id="outline-container-org60c7c2f" class="outline-3">
<h3 id="org60c7c2f">深入理解LINUX内核/Understanding the Linux Kernel</h3>
<div class="outline-text-3" id="text-org60c7c2f">
<p>
深入理解LINUX内核(第三版), 作者<a href="http://bovet.sprg.uniroma2.it/">Daniel P.Bovet</a>与<a href="http://cesati.sprg.uniroma2.it/">Marco Cesati</a>, 翻译陈莉君, 张琼声,
张宏伟. 包含内存寻址, 进程, 中断与异常, 内核同步, 定时测量, 进程调度, 内存管理,
进程地址空间, 系统调用, 信号, 虚拟文件系统, I/O体系结构和设备驱动程序, 块设备驱动程序, 页高速缓存, 访问文件, 回收页框, Ext2与Ext3文件系统, 进程通信, 程序的执行诸多章节.
</p>

<p>
如果只推荐三本LINUX内核编程必读书籍, 我推荐《深入理解LINUX内核》,《深入LINUX内核架构》,《LINUX设备驱动程序》.
</p>

<p>
2008年购得此书已接近10年, 偶有翻阅还是心有所得.
</p>
</div>
</div>

<div id="outline-container-orge8add16" class="outline-3">
<h3 id="orge8add16">LINUX设备驱动程序/Linux Device Drivers</h3>
<div class="outline-text-3" id="text-orge8add16">
<p>
LINUX设备驱动程序(第三版), 作者Jonathan Corbet, Alessandro Rubini,
Greg Kroah-Hartman. 讲解内核模块加载卸载, 构造和运行, 字符设备驱动程序, 调试技术, 并发和竞态, 高级字符驱动程序操作, 时间、延迟及延缓操作, 分配内存, 与硬件通信, 中断处理, 内核的数据结构, PCI驱动程序, USB驱动程序, LINUX设备模型, 内存映射和DMA, 块设备驱动程序, 网络驱动程序, TTY驱动程序.
</p>

<p>
2008年购得此书, 当时缺少适当的技术背景, 读此书颇有收获, 并通过此书快速上手模块开发调试. 在研读深入LINUX内核架构一书, 并多年已处理过PCIe驱动, NIC驱动, I2C驱动后, 偶有翻阅已是不再有困惑.
</p>
</div>
</div>

<div id="outline-container-orga8c6775" class="outline-3">
<h3 id="orga8c6775">深入LINUX内核架构/Professional Linux Kernel Architecture</h3>
<div class="outline-text-3" id="text-orga8c6775">
<p>
深入LINUX内核架构, 作者<a href="https://hps.hs-regensburg.de/maw39987/#/home">Wolfgang Mauerer</a>. 从简介开始, 到进程管理和调度, 内存管理,
进程虚拟内存, 锁与进程间通信, 设备驱动程序, 模块, 虚拟文件系统, Ext文件系统族,
无持久存储的文件系统, 扩展性和访问控制列表, 网络, 系统调用, 内核活动, 页缓存和块缓存, 数据同步, 页面回收和页交换, 审计, 再到附录体系结构, C语言注记, 系统启动,
ELF二进制格式, 内核开发过程, 每一个章节, 都收获颇丰.
</p>

<p>
2012年5月购得此书, 已逾5年. 业余花费小半年完整的啃了一遍, LINUX内核终于不再神秘.
</p>
</div>
</div>
</div>
</div>
</body>
</html>
